Repository: DeveloperAcademy-POSTECH/2024-MacC-A11-HOTnSOURCE
Catalog: Shh/Shh/App/Localizable.xcstrings
Source language: ko
Languages: en

source: - '위험' 에 해당하는 소음이 발생하면 즉시 알림을 보냅니다.
en: - If a noise corresponding to 'Danger' occurs, a notification is sent immediately.

source: - '주의'에 해당하는 소음이 일정시간 지속되면 알림을 보냅니다. 과도한 알림 방지를 위해, 다음 알림은 최소한 30초 뒤에 옵니다.
en: - If the noise corresponding to 'caution' persists for a certain period of time, a notification will be sent. To prevent excessive notifications, the next notification will come at least 30 seconds later.

source: - 경고(파란색): 상대방이 내 소리를 인지하지만 아직 큰 영향은 끼치지 않아요.
en: - Warning (Blue): The other person recognizes your sound, but it doesn't have much impact yet.

source: - 높이가 높을수록 상대방은 시끄럽다고 느껴요.
en: - The higher the height, the louder the other person feels.

source: - 안전(초록색): 내가 낸 소리가 상대방에게 영향을 크게 미치지 않아요.
en: - Safety (green): The sound you make doesn't really affect the other person.

source: - 앱에서 나가거나 화면을 잠궈도 백그라운드에서 측정이 계속 이루어져요. (기기 상단에 노란 점이 켜져 있을 경우 마이크 사용중)
en: - Even if you leave the app or lock the screen, the measurement continues in the background. (While using the microphone, the yellow dot is on at the top of the device)

source: - 위험(분홍색): 상대방이 내 소리를 명백한 소음으로 인식해요.
en: - Dangers (pink): The other person recognizes your sound as obvious noise.

source: - 조심해야 할 경우 푸시 알림으로 알려드려요. 화면을 매번 볼 필요 없이 핸드폰을 내려놓고 편안하게 작업하세요.
en: - If you need to be careful, we'll notify you with a push notification. Put your phone down and work comfortably without having to look at the screen every time.

source: - 측정된 소음 정보는 저장하지 않아요.
en: - We does not store the measured noise information.

source: '내가 낸 소리가 상대방에게 얼마나 크게 들릴지'를 측정하기 위해 기기의 마이크를 사용합니다.
en: Shh-! app uses the microphone of device to check 'how loud my sound will be to the other person'.

source: %@ 삭제
en: %@ delete

source: ✅ Shh-!의 소음 측정은 어떻게 이루어지나요?
en: ✅ How is the noise measurement done for this app?

source: ✅ 내가 시끄러운지 어떻게 알 수 있나요?
en: ✅ How do I know if I'm loud?

source: ✅ 메인 화면의 색상은 무엇을 나타내나요?
en: ✅ What does the color of the main screen represent?

source: ✅ 알림은 언제 오나요?
en: ✅ When do I get the notification?

source: 거리
en: Distance

source: 기준이 될 현장의 배경 소음을 측정하거나 입력해주세요 기준보다 큰 소리를 내시면 알려드릴게요
en: Please measure or input the background noise level of the location as a reference. We will notify you if the noise you make exceeds the reference level.

source: 냉장고, 바람 소리가 들리는 정도의 실내 소음
en: Indoor noise level similar to the sound of a refrigerator or wind

source: 데시벨 설명 없음
en: No decibel explanation

source: 도로변에서 들리는 자동차와 사람들 소리
en: The noise level of cars and people typically heard near a roadside

source: 도서관
en: Library

source: 메인 화면에서 보이는 물결의 높낮이는 내 소리가 얼마나 시끄러운지를 나타냅니다.
en: The highness of the wave you see on the main screen indicates how loud your sound is.

source: 메인 화면의 색상은 '위험 수준'을 나타내요. 이 앱에서는 상대방이 내 소리를 인지하는 정도에 따라, 위험 수준을 세 단계로 구분합니다.
en: The color on the main screen represents the "risk level." There’s three risk levels, depending on the degree to which the other person perceives your sound.

source: 배경 소음
en: Background Noise

source: 삭제
en: Delete

source: 생성하기
en: Create

source: 소음 수준:
en: Noise Level:

source: 수정하기
en: Edit

source: 시끄러운 사무실이나 사람들 간의 활발한 토론 소리
en: The noise of a loud office or lively discussions between people

source: 아래 버튼을 눌러
en: By pressing the button below

source: 아주 조용한 방에서의 환경음
en: The ambient noise in a very quiet room

source: 알 수 없는 오류가 발생했습니다
en: Unknown error occurred.

source: 양호
en: Safe

source: 완료
en: Complete

source: 이름
en: Name

source: 이름을 입력해주세요
en: Please enter name

source: 이제 조금 조심해야 해요
en: You need to be a little cautious now

source: 일상적인 대화 소리, 도로에서의 자동차 소음
en: The sound of everyday conversations and traffic noise from the road

source: 자주 묻는 질문
en: FAQ

source: 장소 삭제하기
en: Delete Location

source: 장소 생성 성공
en: Create new location complete

source: 장소 생성 실패
en: Failed to create new location

source: 장소 선택
en: Select Location

source: 장소는 최대 5개까지 생성 가능합니다
en: You can create up to 5 locations

source: 정말 삭제하시겠습니까?
en: Are you sure you want to delete?

source: 정보
en: Information

source: 조심해야할 대상과의 거리를 측정하거나 입력해주세요 그 곳에서 느낄 당신의 소리 크기를 알려드릴게요
en: Please measure or input the distance from the person you need to be cautious of. We will let you know how loud your sound will be perceived from that location.

source: 조용한 사무실에서 들리는 일반적인 실내 소음
en: Typical indoor noise heard in a quiet office

source: 조용한 카페에서 나오는 배경 소음
en: Background noise in a quiet café

source: 주변 소음 측정
en: Measure ambient noise

source: 주의
en: Caution

source: 주택가에서 들리는 적당한 실내 소음
en: Moderate indoor noise heard in a residential area

source: 중복되는 이름이 존재합니다
en: A duplicate name exists

source: 지금 아주 잘하고 있어요!
en: You’re doing great right now!

source: 취소
en: Cancel

source: 측정 반경
en: Measurement Radius

source: 측정을 시작해주세요
en: Please start the measurement

source: 크기
en: Noise Level

source: 평소 대화 소리나 가정에서의 일상 소음
en: Everyday conversation sounds or typical household noise

source: 확인
en: Confirm
